src/leets-kusto/00_include_kusto_prerequisites.org
* Kusto Explorer Prerequisites
To run the Kusto Query Language (KQL) queries and experiment with Azure Data Explorer, ensure you have the following prerequisites:

** Download Kusto Explorer
Kusto Explorer is a desktop client for querying Kusto databases. You can download it from the following link:
[[https://aka.ms/ke][Download Kusto Explorer]]

** Add a Connection
After installing Kusto Explorer, add a connection to the following endpoint:
[[https://help.kusto.windows.net][help.kusto.windows.net]]

** Azure Account
You need an Azure account with appropriate permissions to log in and query the Kusto database.
Visit [[https://azure.microsoft.com][Azure Portal]] for more information about creating an account.
