docs/leets-kusto/00_include_kusto_prerequisites.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-01-11 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="d)zharii" />
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="stylesheet" href="/static/t.css"/>
</head>
<body>
<nav><a href="/" tabindex="0">&larrhk; Back to Index</a></nav><div id="preamble" class="status">
Published 
</div>
<div id="content" class="content">
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org99a8c19">Kusto Explorer Prerequisites</a>
<ul>
<li><a href="#orga4b8ba5">Download Kusto Explorer</a></li>
<li><a href="#org7253e15">Add a Connection</a></li>
<li><a href="#org6f3544b">Azure Account</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<div id="outline-container-org99a8c19" class="outline-2">
<h2 id="org99a8c19">Kusto Explorer Prerequisites</h2>
<div class="outline-text-2" id="text-org99a8c19">
<p>
To run the Kusto Query Language (KQL) queries and experiment with Azure Data Explorer, ensure you have the following prerequisites:
</p>
</div>

<div id="outline-container-orga4b8ba5" class="outline-3">
<h3 id="orga4b8ba5">Download Kusto Explorer</h3>
<div class="outline-text-3" id="text-orga4b8ba5">
<p>
Kusto Explorer is a desktop client for querying Kusto databases. You can download it from the following link:
<a href="https://aka.ms/ke">Download Kusto Explorer</a>
</p>
</div>
</div>

<div id="outline-container-org7253e15" class="outline-3">
<h3 id="org7253e15">Add a Connection</h3>
<div class="outline-text-3" id="text-org7253e15">
<p>
After installing Kusto Explorer, add a connection to the following endpoint:
<a href="https://help.kusto.windows.net">help.kusto.windows.net</a>
</p>
</div>
</div>

<div id="outline-container-org6f3544b" class="outline-3">
<h3 id="org6f3544b">Azure Account</h3>
<div class="outline-text-3" id="text-org6f3544b">
<p>
You need an Azure account with appropriate permissions to log in and query the Kusto database.
Visit <a href="https://azure.microsoft.com">Azure Portal</a> for more information about creating an account.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
&copy; d)zharii. <a href="/sitemap.html">sitemap</a>
</div>
</body>
</html>
